server/app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all

INSERT INTO "items" ("name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Bread"], ["quantity", 3], ["created_at", "2025-10-31 08:00:25.057077"], ["updated_at", "2025-10-31 08:00:25.057077"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["quantity", 4], ["updated_at", "2025-10-31 08:47:00.326238"], ["id", 1]]
---
  def update
    if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]
---
  def destroy
    @item.destroy!

SELECT "items".* FROM "items" WHERE "items"."barcode" = ?  [["barcode", "1234"]]
---
  def search_barcode
    render json: Item.where(barcode: params[:code])

SELECT "items".* FROM "items" WHERE (date() > useby)
---
  def notifications
    render json: Item.where("date() > useby_notify OR date() > useby OR low_stock_threshold >= quantity")

SELECT "items".* FROM "items" WHERE (date() > useby_notify OR date() > useby OR low_stock_threshold >= quantity)
---
    def set_item
      @item = Item.find(params[:id])