server/app/controllers/shopping_list_controller.rb

SELECT "shopping_lists".* FROM "shopping_lists"
---
  def index
    @items = ShoppingList.all

INSERT INTO "shopping_lists" ("name", "quantity", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["quantity", 100], ["item_id", nil], ["created_at", "2025-11-02 06:52:49.618070"], ["updated_at", "2025-11-02 06:52:49.618070"]]
---
  def create
    @item = ShoppingList.new(item_params)

    if @item.save